oderwat.indent-rainbow
eamodio.gitlens
saoudrizwan.claude-dev
Gruntfuggly.todo-tree
vscode-icons-team.vscode-icons
mechatroner.rainbow-csv
esbenp.prettier-vscode
formulahendry.auto-rename-tag
MS-vsliveshare.vsliveshare
ritwickdey.LiveServer
GitHub.github-vscode-theme
streetsidesoftware.code-spell-checker
ms-vscode-remote.remote-ssh
ms-python.black-formatter
yzhang.markdown-all-in-one
github.vscode-github-actions
k--kato.intellij-idea-keybindings
ms-vscode.makefile-tools
bradymholt.pgformatter